SRCS = $(wildcard *.c) #переменная для исходников с маской, чтобы брать все файлы с расширением *.c
OBJS = $(SRCS:.c=.o)   #переменная для объектных файлов, где за имя берётся имя исходяника
DEPS = $(SRCS:.c=.d)   #переменная для файлов зависимостей, которые будут создаваться во время компиляции .o

all: release

release: $(OBJS)           #линковка
	gcc $(OBJS) -o test_mmio

%.o: %.c               #создание объектных файлов и файлов зависимостей
	gcc -MMD -MP -c $< -o $@

clean:                 #цель, которая очищает каталог от объектных файлов и слинкованного 
	rm -f $(OBJS) test_mmio

include $(DEPS)        #включить существующие зависимости
